Revit 2027 API
Form.HasOpenGeometry Property
Tell if the form has an open geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasOpenGeometry { get; }
Public ReadOnly Property HasOpenGeometry As Boolean
	Get
public:
property bool HasOpenGeometry {
	bool get ();
}
member HasOpenGeometry : bool with get
Property Value
Boolean
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace